{"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAUwAAAHMUAAAAfABkAGQAhQJkAGQBhQJmAhkAUwApAk7pgAAA\nAKkAqQHaAXhyAgAAAHICAAAA+jUvaG9tZS9mYXJpcy9EZXZlbC9TdHlsZUdBTi1UZW5zb3JmbG93\nLTIuMC9zdHlsZWdhbi5wedoIPGxhbWJkYT7YAAAAcwIAAAAUAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 3072, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [4, 4, 192]}, "name": "reshape", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "linear"}, "name": "activation", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_8"}, "name": "input_8", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAMAAAAGAAAAQwAAAHNAAAAAfABkARkAagBkARkAfQF8AGQBGQBqAGQCGQB9\nAnwAZAMZAGQAZACFAmQAfAGFAmQAfAKFAmQAZACFAmYEGQBTACkETukBAAAA6QIAAADpAAAAAKkB\n2gVzaGFwZSkD2gF42gZoZWlnaHTaBXdpZHRoqQByCQAAAPo1L2hvbWUvZmFyaXMvRGV2ZWwvU3R5\nbGVHQU4tVGVuc29yZmxvdy0yLjAvc3R5bGVnYW4ucHnaC2Nyb3BfdG9fZml0WAAAAHMGAAAADgIO\nASQC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["input_8", 0, 0, {}], ["activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 768, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["conv2d_7", 0, 0, {}], ["dense_9", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAcAAAAFAAAAQwAAAHOGAAAAdABqAXwAZAEZAGQCZANnAmQEZAWNA30BdABq\nAnwAZAEZAGQCZANnAmQEZAWNA2QGFwB9AnwAZAEZAHwBGAB8AhsAfQNkB2QCZAJ8A2oDZAcZAGcE\nfQR0BKAFfABkAhkAfAShAmQIFwB9BXQEoAV8AGQDGQB8BKECfQZ8A3wFFAB8BhcAUwApCU7pAAAA\nAOkBAAAA6QIAAABUKQLaBGF4aXPaCGtlZXBkaW1z50ivvJry13o+6f/////nAAAAAAAA8D8pBtoB\nS9oEbWVhbtoDc3Rk2gVzaGFwZdoCdGbaB3Jlc2hhcGUpB9oBeHIKAAAAcgsAAADaAXnaCnBvb2xf\nc2hhcGXaAWfaAWKpAHIUAAAA+jUvaG9tZS9mYXJpcy9EZXZlbC9TdHlsZUdBTi1UZW5zb3JmbG93\nLTIuMC9zdHlsZWdhbi5wedoFQWRhSU4/AAAAcw4AAAAYAhwBEAESAxQBEAEMAw==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_2", "inbound_nodes": [[["add", 0, 0, {}], ["dense_7", 0, 0, {}], ["dense_8", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_12", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_12", "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAMAAAAGAAAAQwAAAHNAAAAAfABkARkAagBkARkAfQF8AGQBGQBqAGQCGQB9\nAnwAZAMZAGQAZACFAmQAfAGFAmQAfAKFAmQAZACFAmYEGQBTACkETukBAAAA6QIAAADpAAAAAKkB\n2gVzaGFwZSkD2gF42gZoZWlnaHTaBXdpZHRoqQByCQAAAPo1L2hvbWUvZmFyaXMvRGV2ZWwvU3R5\nbGVHQU4tVGVuc29yZmxvdy0yLjAvc3R5bGVnYW4ucHnaC2Nyb3BfdG9fZml0WAAAAHMGAAAADgIO\nASQC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_3", "inbound_nodes": [[["input_8", 0, 0, {}], ["up_sampling2d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_8", "inbound_nodes": [[["up_sampling2d", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_12", "inbound_nodes": [[["lambda_3", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["dense_12", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_10", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAcAAAAFAAAAQwAAAHOGAAAAdABqAXwAZAEZAGQCZANnAmQEZAWNA30BdABq\nAnwAZAEZAGQCZANnAmQEZAWNA2QGFwB9AnwAZAEZAHwBGAB8AhsAfQNkB2QCZAJ8A2oDZAcZAGcE\nfQR0BKAFfABkAhkAfAShAmQIFwB9BXQEoAV8AGQDGQB8BKECfQZ8A3wFFAB8BhcAUwApCU7pAAAA\nAOkBAAAA6QIAAABUKQLaBGF4aXPaCGtlZXBkaW1z50ivvJry13o+6f/////nAAAAAAAA8D8pBtoB\nS9oEbWVhbtoDc3Rk2gVzaGFwZdoCdGbaB3Jlc2hhcGUpB9oBeHIKAAAAcgsAAADaAXnaCnBvb2xf\nc2hhcGXaAWfaAWKpAHIUAAAA+jUvaG9tZS9mYXJpcy9EZXZlbC9TdHlsZUdBTi1UZW5zb3JmbG93\nLTIuMC9zdHlsZWdhbi5wedoFQWRhSU4/AAAAcw4AAAAYAhwBEAESAxQBEAEMAw==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_4", "inbound_nodes": [[["add_1", 0, 0, {}], ["dense_10", 0, 0, {}], ["dense_11", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_13", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_13", "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_1", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAMAAAAGAAAAQwAAAHNAAAAAfABkARkAagBkARkAfQF8AGQBGQBqAGQCGQB9\nAnwAZAMZAGQAZACFAmQAfAGFAmQAfAKFAmQAZACFAmYEGQBTACkETukBAAAA6QIAAADpAAAAAKkB\n2gVzaGFwZSkD2gF42gZoZWlnaHTaBXdpZHRoqQByCQAAAPo1L2hvbWUvZmFyaXMvRGV2ZWwvU3R5\nbGVHQU4tVGVuc29yZmxvdy0yLjAvc3R5bGVnYW4ucHnaC2Nyb3BfdG9fZml0WAAAAHMGAAAADgIO\nASQC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_5", "inbound_nodes": [[["input_8", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float32", "filters": 288, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 288, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_15", "inbound_nodes": [[["lambda_5", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["dense_15", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 288, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_13", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 288, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_14", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAcAAAAFAAAAQwAAAHOGAAAAdABqAXwAZAEZAGQCZANnAmQEZAWNA30BdABq\nAnwAZAEZAGQCZANnAmQEZAWNA2QGFwB9AnwAZAEZAHwBGAB8AhsAfQNkB2QCZAJ8A2oDZAcZAGcE\nfQR0BKAFfABkAhkAfAShAmQIFwB9BXQEoAV8AGQDGQB8BKECfQZ8A3wFFAB8BhcAUwApCU7pAAAA\nAOkBAAAA6QIAAABUKQLaBGF4aXPaCGtlZXBkaW1z50ivvJry13o+6f/////nAAAAAAAA8D8pBtoB\nS9oEbWVhbtoDc3Rk2gVzaGFwZdoCdGbaB3Jlc2hhcGUpB9oBeHIKAAAAcgsAAADaAXnaCnBvb2xf\nc2hhcGXaAWfaAWKpAHIUAAAA+jUvaG9tZS9mYXJpcy9EZXZlbC9TdHlsZUdBTi1UZW5zb3JmbG93\nLTIuMC9zdHlsZWdhbi5wedoFQWRhSU4/AAAAcw4AAAAYAhwBEAESAxQBEAEMAw==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_6", "inbound_nodes": [[["add_2", 0, 0, {}], ["dense_13", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_14", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_14", "inbound_nodes": [[["lambda_6", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_2", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAMAAAAGAAAAQwAAAHNAAAAAfABkARkAagBkARkAfQF8AGQBGQBqAGQCGQB9\nAnwAZAMZAGQAZACFAmQAfAGFAmQAfAKFAmQAZACFAmYEGQBTACkETukBAAAA6QIAAADpAAAAAKkB\n2gVzaGFwZSkD2gF42gZoZWlnaHTaBXdpZHRoqQByCQAAAPo1L2hvbWUvZmFyaXMvRGV2ZWwvU3R5\nbGVHQU4tVGVuc29yZmxvdy0yLjAvc3R5bGVnYW4ucHnaC2Nyb3BfdG9fZml0WAAAAHMGAAAADgIO\nASQC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_7", "inbound_nodes": [[["input_8", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_10", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_18", "inbound_nodes": [[["lambda_7", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_5"}, "name": "input_5", "inbound_nodes": []}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["dense_18", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_16", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_17", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAcAAAAFAAAAQwAAAHOGAAAAdABqAXwAZAEZAGQCZANnAmQEZAWNA30BdABq\nAnwAZAEZAGQCZANnAmQEZAWNA2QGFwB9AnwAZAEZAHwBGAB8AhsAfQNkB2QCZAJ8A2oDZAcZAGcE\nfQR0BKAFfABkAhkAfAShAmQIFwB9BXQEoAV8AGQDGQB8BKECfQZ8A3wFFAB8BhcAUwApCU7pAAAA\nAOkBAAAA6QIAAABUKQLaBGF4aXPaCGtlZXBkaW1z50ivvJry13o+6f/////nAAAAAAAA8D8pBtoB\nS9oEbWVhbtoDc3Rk2gVzaGFwZdoCdGbaB3Jlc2hhcGUpB9oBeHIKAAAAcgsAAADaAXnaCnBvb2xf\nc2hhcGXaAWfaAWKpAHIUAAAA+jUvaG9tZS9mYXJpcy9EZXZlbC9TdHlsZUdBTi1UZW5zb3JmbG93\nLTIuMC9zdHlsZWdhbi5wedoFQWRhSU4/AAAAcw4AAAAYAhwBEAESAxQBEAEMAw==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_8", "inbound_nodes": [[["add_3", 0, 0, {}], ["dense_16", 0, 0, {}], ["dense_17", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_15", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_15", "inbound_nodes": [[["lambda_8", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_3", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAMAAAAGAAAAQwAAAHNAAAAAfABkARkAagBkARkAfQF8AGQBGQBqAGQCGQB9\nAnwAZAMZAGQAZACFAmQAfAGFAmQAfAKFAmQAZACFAmYEGQBTACkETukBAAAA6QIAAADpAAAAAKkB\n2gVzaGFwZSkD2gF42gZoZWlnaHTaBXdpZHRoqQByCQAAAPo1L2hvbWUvZmFyaXMvRGV2ZWwvU3R5\nbGVHQU4tVGVuc29yZmxvdy0yLjAvc3R5bGVnYW4ucHnaC2Nyb3BfdG9fZml0WAAAAHMGAAAADgIO\nASQC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_9", "inbound_nodes": [[["input_8", 0, 0, {}], ["up_sampling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_11", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 144, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_21", "inbound_nodes": [[["lambda_9", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}, "name": "input_6", "inbound_nodes": []}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "name": "add_4", "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["dense_21", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 144, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_19", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 144, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_20", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAcAAAAFAAAAQwAAAHOGAAAAdABqAXwAZAEZAGQCZANnAmQEZAWNA30BdABq\nAnwAZAEZAGQCZANnAmQEZAWNA2QGFwB9AnwAZAEZAHwBGAB8AhsAfQNkB2QCZAJ8A2oDZAcZAGcE\nfQR0BKAFfABkAhkAfAShAmQIFwB9BXQEoAV8AGQDGQB8BKECfQZ8A3wFFAB8BhcAUwApCU7pAAAA\nAOkBAAAA6QIAAABUKQLaBGF4aXPaCGtlZXBkaW1z50ivvJry13o+6f/////nAAAAAAAA8D8pBtoB\nS9oEbWVhbtoDc3Rk2gVzaGFwZdoCdGbaB3Jlc2hhcGUpB9oBeHIKAAAAcgsAAADaAXnaCnBvb2xf\nc2hhcGXaAWfaAWKpAHIUAAAA+jUvaG9tZS9mYXJpcy9EZXZlbC9TdHlsZUdBTi1UZW5zb3JmbG93\nLTIuMC9zdHlsZWdhbi5wedoFQWRhSU4/AAAAcw4AAAAYAhwBEAESAxQBEAEMAw==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_10", "inbound_nodes": [[["add_4", 0, 0, {}], ["dense_19", 0, 0, {}], ["dense_20", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_16", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_16", "inbound_nodes": [[["lambda_10", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_4", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_4", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_11", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAMAAAAGAAAAQwAAAHNAAAAAfABkARkAagBkARkAfQF8AGQBGQBqAGQCGQB9\nAnwAZAMZAGQAZACFAmQAfAGFAmQAfAKFAmQAZACFAmYEGQBTACkETukBAAAA6QIAAADpAAAAAKkB\n2gVzaGFwZSkD2gF42gZoZWlnaHTaBXdpZHRoqQByCQAAAPo1L2hvbWUvZmFyaXMvRGV2ZWwvU3R5\nbGVHQU4tVGVuc29yZmxvdy0yLjAvc3R5bGVnYW4ucHnaC2Nyb3BfdG9fZml0WAAAAHMGAAAADgIO\nASQC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_11", "inbound_nodes": [[["input_8", 0, 0, {}], ["up_sampling2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_12", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_24", "inbound_nodes": [[["lambda_11", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}, "name": "input_7", "inbound_nodes": []}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "name": "add_5", "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["dense_24", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_22", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_23", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAcAAAAFAAAAQwAAAHOGAAAAdABqAXwAZAEZAGQCZANnAmQEZAWNA30BdABq\nAnwAZAEZAGQCZANnAmQEZAWNA2QGFwB9AnwAZAEZAHwBGAB8AhsAfQNkB2QCZAJ8A2oDZAcZAGcE\nfQR0BKAFfABkAhkAfAShAmQIFwB9BXQEoAV8AGQDGQB8BKECfQZ8A3wFFAB8BhcAUwApCU7pAAAA\nAOkBAAAA6QIAAABUKQLaBGF4aXPaCGtlZXBkaW1z50ivvJry13o+6f/////nAAAAAAAA8D8pBtoB\nS9oEbWVhbtoDc3Rk2gVzaGFwZdoCdGbaB3Jlc2hhcGUpB9oBeHIKAAAAcgsAAADaAXnaCnBvb2xf\nc2hhcGXaAWfaAWKpAHIUAAAA+jUvaG9tZS9mYXJpcy9EZXZlbC9TdHlsZUdBTi1UZW5zb3JmbG93\nLTIuMC9zdHlsZWdhbi5wedoFQWRhSU4/AAAAcw4AAAAYAhwBEAESAxQBEAEMAw==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_12", "inbound_nodes": [[["add_5", 0, 0, {}], ["dense_22", 0, 0, {}], ["dense_23", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_17", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_17", "inbound_nodes": [[["lambda_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_13", "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0], ["input_5", 0, 0], ["input_6", 0, 0], ["input_7", 0, 0], ["input_8", 0, 0]], "output_layers": [["conv2d_13", 0, 0]]}, "keras_version": "2.8.0", "backend": "tensorflow"}